# -*- coding: utf-8 -*-
# @Time    : 2018/1/19 16:25
# @Author  : zhao.chencheng
# @Email   : 907779487@qq.com
# @File    : config.py
# @Software: PyCharm Community Edition
#登陆 url 用户名 密码
# url ="http://192.168.2.1"
url ="http://117.71.57.195:8888"
username = "admin"
pwd = "admin"

#*****************************************************************#
''' 外网配置'''
#外网配置 wan口ip 子网掩码 网关地址
wan_ip = ["192.168.30.115","192.168.30.117","192.168.30.118","192.168.30.119"]
wan_ip1 = ["192.168.3.116","192.168.3.117","192.168.3.118","192.168.3.119"]

netmask = "255.255.255.0"
GWaddr1 ="192.168.3.5"
GWaddr ="192.168.30.1"
DNSaddr = "114.114.114.114"

#PPPOE 账号和密码  --- 应该用字典 写   后续修改
pppoeuser = ['1','2','3','4']
pppoepwd =['1','2','3','4']


#*****************************************************************#
'''内网配置'''






#vlan 配置
vlan_lanipname = ["222","223","224"]
vlan_ip = ["192.168.222.1","192.168.223.1","192.168.224.1"]
vlan_id = ["222","223","224"]

#*****************************************************************#
'''DHCP服务'''

#*****************************************************************#
'''端口映射'''

#静态映射
new_rulename = ["AC12","AC23"]
inaddr = ["192.168.2.33","192.168.2.55"]
inport = ["80","88"]
outport = ["8081","8888"]

#NAT规则
NAT_rulename = ["192.123","1212"]
inaddr_begin = ["192.168.2.3","192.168.2.22"]
inaddr_end = ["192.168.2.5","192.168.2.25"]
outaddr = ["192.168.30.22","192.168.30.55"]


#DMZ主机

globalDMZHost = "192.168.2.22"


#*****************************************************************#
'''路由配置'''
#静态路由
router_static_name =["333",'444']  #规则名称
rou_static_destNet = ["192.168.3.22","192.168.4.23"] #目的网络
rou_static_netmask= ["255.255.255.0","255.255.255.0"] #子网掩码
rou_static_GWay =["192.168.2.112","192.168.3.4"] #网关地址
rou_static_priority = ["1","2"] #优先级


#策略路由
router_strategy_name = ["ap","ac"]
router_RouteLevel = ['1','2']





